wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_usb.h
/*
 *******************************************************************************
    @file     reg_core.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_USB_H
#define __REG_USB_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>

#if 0
/* IP_USB_FS_DesignSpec_v11_EN_MZ3291_uniformed */
#endif

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default -----------------------------------*/
#else
#warning Not supported compiler type
#endif


/*!
 * @brief USB Base Address Definition
 */
#define USB_BASE                        (0x50000000)              /*!< Base Address: 0x50000000 */


/*!
 * @brief USB Register Structure Definition
 */

typedef struct {
    __IO uint32_t Reserved55[4];                                                  /*!< Reserved                                                  */
    __IO uint32_t FSOTGISTAT;                                                     /*!< OTG Interrupt Status Register                offset: 0x10 */
    __IO uint32_t FSOTGICTRL;                                                     /*!< OTG Interrupt Control Register               offset: 0x14 */
    __IO uint32_t FSOTGSTAT;                                                      /*!< OTG Status Register                          offset: 0x18 */
    __IO uint32_t FSOTGCTRL;                                                      /*!< OTG Control Register                         offset: 0x1C */
    __IO uint32_t Reserved56[24];                                                 /*!< Reserved                                                  */
    __IO uint32_t FSINTSTAT;                                                      /*!< Interrupt Status Register                    offset: 0x80 */
    __IO uint32_t FSINTENB;                                                       /*!< Interrupt Enable Register                    offset: 0x84 */
    __IO uint32_t FSERRSTAT;                                                      /*!< Error Interrupt Status Register              offset: 0x88 */
    __IO uint32_t FSERRENB;                                                       /*!< Error Interrupt Enable Register              offset: 0x8C */
    __IO uint32_t FSSTAT;                                                         /*!< Status Register                              offset: 0x90 */
    __IO uint32_t FSCTL;                                                          /*!< Control Register                             offset: 0x94 */
    __IO uint32_t FSADDR;                                                         /*!< Address Register                             offset: 0x98 */
    __IO uint32_t FSBDTPAGE1;                                                     /*!< BDT Page Register 1                          offset: 0x9C */
    __IO uint32_t FSFRMNUML;                                                      /*!< Frame Number Register                        offset: 0xA0 */
    __IO uint32_t FSFRMNUMH;                                                      /*!< Frame Number Register                        offset: 0xA4 */
    __IO uint32_t FSTOKEN;                                                        /*!< Token Register                               offset: 0xA8 */
    __IO uint32_t FSSOFTHLD;                                                      /*!< SOF Threshold Register                       offset: 0xAC */
    __IO uint32_t FSBDTPAGE2;                                                     /*!< BDT Page Register 2                          offset: 0xB0 */
    __IO uint32_t FSBDTPAGE3;                                                     /*!< BDT Page Register 3                          offset: 0xB4 */
    __IO uint32_t Reserved57[2];                                                  /*!< Reserved                                                  */
    __IO uint32_t FSEPCTL[16];                                                    /*!< Endpoint control register 0 ~15              offset: 0xC0 */
    __IO uint32_t FSUSBCTRL;                                                      /*!< USB control register                         offset 0x100 */
} USB_Type;


